In [2]:
import pandas as pd
import numpy as np

In [62]:
# Salaries1.csv 파일을 dataframe으로 읽으시오
df = pd.read_csv("./data/Salaries1.csv")
df.head(3)

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

In [63]:
# BasePay의 평균은 얼마인가?
df['BasePay'].mean()

75601.13714620461

In [64]:
# OverTimePay의 최대값은 ?
df['OvertimePay'].max()

245131.88

In [65]:
# 'JOSEPH DRISCOLL'의 JOB TITLE은?
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [66]:
# TotalPayBenefit의 최고금액을 수령하는 사람의 이름은?
df[df['TotalPayBenefits'].max() == df['TotalPayBenefits']]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [67]:
# BasePay의 연도별 평균금액은?
df.groupby('Year')['BasePay'].mean()

Year
2011     63595.956517
2012    106964.140280
Name: BasePay, dtype: float64

In [68]:
# JobTitle에서 가장 많은 Job 상위 5개?
df.groupby('JobTitle')['BasePay'].count().sort_values(ascending=False)[:5]

JobTitle
TRANSIT OPERATOR    2388
SPECIAL NURSE       1402
REGISTERED NURSE    1219
Registered Nurse    1003
CUSTODIAN            796
Name: BasePay, dtype: int64

In [104]:
# 2011년도에 오직 한 사람만이 수행하는 job의 갯수는?

sum(df[(df["Year"] == 2011)]['JobTitle'].value_counts() == 1)
# sum(df[df["Year"] == 2011].groupby("JobTitle")['JobTitle'].count() == 1)

200

In [102]:
# Chief 라는 직업을 가진 사람의 수
jobtitle = df['JobTitle'].apply(lambda x: x.lower())


for t in jobtitle:
    if 'chief' in t:
        total += 1
total

318

In [100]:
sum(df['JobTitle'].apply(lambda x: x.lower()).str.contains('chief'))

318

In [112]:
import pandas as pd
import numpy as np

In [113]:
df = pd.read_csv("./data/seoul_weather.csv", encoding='cp949', skiprows=11)
df.head(2)

   \t\t지점번호 지점명          일시  평균기온(℃)  최고기온(℃) \t최고기온시각  최저기온(℃) 최저기온시각
0       108  서울  1907-10-01     13.5     20.7      NaN      7.9    NaN
1       108  서울  1907-10-02     16.2     22.0      NaN      7.9    NaN

In [151]:
# 역대 최고기온인 날의 날짜는?
df[df['최고기온(℃)'] == df['최고기온(℃)'].max()]['일시']

40051    2018-08-01
Name: 일시, dtype: object

In [189]:
# 일교차가 가장 큰 월은 언제인가?
df['month'] = df['일시'].apply(lambda x:x.split("-")[1])
gap = df['최고기온(℃)'] - df['최저기온(℃)']
r_index = gap.sort_values(ascending=False).index[0]
df.loc[r_index]['month']

'04'

In [153]:
# 월교차가 가장 큰 월은
avg = df.groupby("month")['최고기온(℃)'].mean() - df.groupby("month")['최저기온(℃)'].mean()
avg.sort_values(ascending=False).index[0]

'10'